# Cooper Wolf
# CMPS 5993 - Spatial-Data
# 2/2/26

## Combining all quizzes from Part 1 to this Notebook in order to refresh memory on python basics.

### List, Tuples and Dictionaries

In [ ]:
# remove value from list

l = [1,2,3,4,5,6]

print(l)
print()

l.remove(3)

print("Removing 3 from list.")
print(l)

[1, 2, 3, 4, 5, 6]

Removing 3 from list.
[1, 2, 4, 5, 6]

In [ ]:
# Accessing and modifing elements in tuple

t = (1,2,3,4,5,6)

# accessing fourth element in tuple and storing in variable
value = t[3]

print("4th value in tuple is", value)



# modifing fourth element from "4" to "40"
#t[3] = 40
#print("Changing 4th value from '4' to '40'")
#print(t)

# ERROR, cannot modify elements in tuple

4th value in tuple is 4

In [ ]:
D = {
    "apple":"10",
    "banana":"11",
    "cherry":"8"
}

# Print keys only
for key in D.keys():
    print(key)
    
print()
    
# Print values only
for val in D.values():
    print(val)
    
print()
    
# Print values only by .get() method
for key in D.keys():
    print(D.get(key))
    
print()
    
# Print key-value
for key,val in D.items():
    print(key,  "->", val)

### Scalar_Types and Control_Flow

In [ ]:
x=7
y=15
z=10

# Determine if z is between x and y
print(x <= z <= y)

True

In [ ]:
score = 100

if score == 100:
    print("Perfect Score")

Perfect Score

### Loops and Iterations

In [ ]:
l2 = list(range(1,10,2))

print(l2)

[1, 3, 5, 7, 9]

In [ ]:
for i in range(1,10):
    if i ==6:
        break
    else:
        print(i)

1
2
3
4
5

In [ ]:
for i in range(3):
    print("Loop:", i)

Loop: 0
Loop: 1
Loop: 2

### Foundations

In [ ]:
%pwd

'/workspaces/5993-Spatial_Maps/Assignments/Part_01'

### Working with Data_Advanced

In [ ]:
!pip install pandas

In [ ]:
import pandas as pd

In [ ]:
# A Series from a list — just like a list, but fancier and labeled
prices = pd.Series([2.99, 4.49, 1.99], index=["Apple", "Milk", "Bread"])
print("Grocery Prices:")
print(prices)

# Accessing elements like a dictionary
print("\nPrice of Milk:", prices["Milk"])

Grocery Prices:
Apple    2.99
Milk     4.49
Bread    1.99
dtype: float64

Price of Milk: 4.49

In [ ]:
# Creating a DataFrame — the bread and butter of Pandas
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana"],
    "GPA": [3.9, 2.7, 3.4, 3.8],
    "Credits": [90, 45, 60, 120],
    "Graduating": [False, False, False, True]
}

students = pd.DataFrame(data)
print("Student DataFrame:")
print(students)

# Access a column
print("\nGPA column:")
print(students["GPA"])

# Access a row
print("\nCharlie's record:")
print(students.loc[2])

Student DataFrame:
      Name  GPA  Credits  Graduating
0    Alice  3.9       90       False
1      Bob  2.7       45       False
2  Charlie  3.4       60       False
3    Diana  3.8      120        True

GPA column:
0    3.9
1    2.7
2    3.4
3    3.8
Name: GPA, dtype: float64

Charlie's record:
Name          Charlie
GPA               3.4
Credits            60
Graduating      False
Name: 2, dtype: object

In [ ]:
df = pd.read_csv("pokemon.csv")
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [ ]:
# Accessing specific data using loc
df.loc[5:10, ["Name", "Attack"]]

                         Name  Attack
5                  Charmeleon      64
6                   Charizard      84
7   CharizardMega Charizard X     130
8   CharizardMega Charizard Y     104
9                    Squirtle      48
10                  Wartortle      63

In [ ]:
# Accessing specific data using iloc
df.iloc[10:15]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
10,8,Wartortle,Water,NaN,405,59,63,80,65,80,58,1,False
11,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,1,False
12,9,BlastoiseMega Blastoise,Water,NaN,630,79,103,120,135,115,78,1,False
13,10,Caterpie,Bug,NaN,195,45,30,35,20,20,45,1,False
14,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,1,False

In [ ]:
# Filtering

fast_legend = df[(df["Speed"] >= 150) & (df["Legendary"] == True)]

fast_legend[["Name", "Type 1"]]

                   Name   Type 1
428  DeoxysNormal Forme  Psychic
429  DeoxysAttack Forme  Psychic
431   DeoxysSpeed Forme  Psychic

In [2]:
# Cleaning

import pandas as pd
import numpy as np

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", None],
    "Age": ["25", "thirty", 35, np.nan, "40"],
    "Signup Date": ["2022-01-01", "not a date", "2022/03/01", None, "April 5, 2022"],
    "Score": [95.5, None, 88.0, 92.5, ""]
}

df = pd.DataFrame(data)
df

      Name     Age    Signup Date Score
0    Alice      25     2022-01-01  95.5
1      Bob  thirty     not a date  None
2  Charlie      35     2022/03/01  88.0
3    David     NaN            NaN  92.5
4      NaN      40  April 5, 2022

In [ ]:
df[df.isnull().any(axis=1)]

    Name     Age    Signup Date Score
1    Bob  thirty     not a date  None
3  David     NaN            NaN  92.5
4    NaN      40  April 5, 2022

In [ ]:
df.fillna({
    "Name": "Unknown",
    "Age": -1,
    "Signup Date": "1970-01-01",
    "Score": 0.0
})

      Name     Age    Signup Date Score
0    Alice      25     2022-01-01  95.5
1      Bob  thirty     not a date   0.0
2  Charlie      35     2022/03/01  88.0
3    David      -1     1970-01-01  92.5
4  Unknown      40  April 5, 2022

In [ ]:
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")
df["Score"] = pd.to_numeric(df["Score"], errors="coerce")
df["Signup Date"] = pd.to_datetime(df["Signup Date"], errors="coerce")
df.dtypes

Name                      str
Age                   float64
Signup Date    datetime64[us]
Score                 float64
dtype: object

In [ ]:
df["Age"].fillna(df["Age"].median(), inplace=True)
df["Score"].fillna(df["Score"].mean(), inplace=True)
df["Signup Date"].fillna(df["Signup Date"].min(), inplace=True)
df["Name"].fillna("Unknown", inplace=True)

df

In [28]:
data = {
    "first_name": ["Alice", "Bob", "Charlie", "David"],
    "last_name": ["Smith", "Jones", "Brown", "Wilson"],
    "math_score": [85, 90, 78, 92],
    "science_score": [88, 85, 82, 95]
}

df = pd.DataFrame(data)

# Creating new columns
df["average_score"] = (df["math_score"] + df["science_score"]) / 2

# Renaming column header
df.rename(columns={"math_score": "Math", "science_score": "Science"}, inplace=True)

# Functino to calculate grade
def grade(score):
    if score >= 90:
        return "A"
    elif score >=80:
        return "B"
    elif score >=70:
        return "C" 
    elif score >= 60:
        return "D"

# Creating new column for grades
df["Grade"] = df["average_score"].apply(grade)

df

  first_name last_name  Math  Science  average_score Grade
0      Alice     Smith    85       88           86.5     B
1        Bob     Jones    90       85           87.5     B
2    Charlie     Brown    78       82           80.0     B
3      David    Wilson    92       95           93.5     A

In [38]:
# Adding some columns for more practice
df["Bonus"] = 5
df["average_score"] = df["average_score"] + df["Bonus"]
df["Grade"] = df["average_score"].apply(grade)
df

  first_name last_name  Math  Science  average_score Grade  Bonus
0      Alice     Smith    85       88          136.5     A      5
1        Bob     Jones    90       85          137.5     A      5
2    Charlie     Brown    78       82          130.0     A      5
3      David    Wilson    92       95          143.5     A      5

In [40]:
poke = pd.read_csv("pokemon.csv")

In [44]:
poke.sort_values(by=["Speed", "Attack"], ascending=[False, False])

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
431,386,DeoxysSpeed Forme,Psychic,NaN,600,50,95,90,95,90,180,3,True
315,291,Ninjask,Bug,Flying,456,61,90,45,50,50,160,3,False
429,386,DeoxysAttack Forme,Psychic,NaN,600,50,180,20,180,20,150,3,True
428,386,DeoxysNormal Forme,Psychic,NaN,600,50,150,50,150,50,150,3,True
154,142,AerodactylMega Aerodactyl,Rock,Flying,615,80,135,85,70,95,150,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,328,Trapinch,Ground,NaN,290,45,100,45,45,45,10,3,False
486,438,Bonsly,Rock,NaN,290,50,80,95,10,45,10,4,False
658,597,Ferroseed,Grass,Steel,305,44,50,91,24,86,10,5,False
495,446,Munchlax,Normal,NaN,390,135,85,40,40,85,5,4,False
230,213,Shuckle,Bug,Rock,505,20,10,230,10,230,5,2,False

In [48]:
fast = poke.query("Speed >=150")
fast.sort_values(by="Name")

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
154,142,AerodactylMega Aerodactyl,Rock,Flying,615,80,135,85,70,95,150,1,False
71,65,AlakazamMega Alakazam,Psychic,NaN,590,55,50,65,175,95,150,1,False
429,386,DeoxysAttack Forme,Psychic,NaN,600,50,180,20,180,20,150,3,True
428,386,DeoxysNormal Forme,Psychic,NaN,600,50,150,50,150,50,150,3,True
431,386,DeoxysSpeed Forme,Psychic,NaN,600,50,95,90,95,90,180,3,True
315,291,Ninjask,Bug,Flying,456,61,90,45,50,50,160,3,False

### Describing and Visualizing Data